[

{
    "_template": "innertemp",
    "content":"<h2>Let&#8217;s Get Down to Business</h2><p>Imagine your next  business meeting, conference, convention, tradeshow, group gathering, or  special event with a backdrop of the Pocono Mountains. With spacious facilities  and a staff devoted to ensuring every detail is worry-free, Split Rock Resort  is the ideal venue to host your next meeting or event. Whether you&rsquo;re putting  the finishing touches on a new product, energizing your sales teams, or holding  workshops or training sessions, our dedicated sales team guarantees the success  of your meeting or event by consistently delivering high-quality meeting rooms,  audiovisual equipment to meet your exact needs, and fantastic catering.</p><h3>Our Facilities</h3><p>If you are planning a meeting or event in Northeastern Pennsylvania, our resort can offer 76,000 square feet of extensive banquet and meeting facilities, accommodating anywhere from 15 to 1,500 people. Download our <a href='/pdfs/SR_MPG.pdf' target='_blank'>Meeting Planner Guide</a> (PDF) to see a full capacity chart and floor plan.</p><h3>Tradeshows &amp; Conventions</h3><p>Our on-site Expo Center offers some of the largest exhibit space in the Pocono Mountain region of Northeastern Pennsylvania. We feature over 76,000 gross square feet of space, which can accommodate up to 250 10x10 booths. We offer set-up and tear-down of shows for convenience with a standard loading dock for tractor trailers, as well as a two-story high garage door for easy vehicle access if needed. The center also has a permanent registration desk and plenty of complimentary parking spaces.</p><p>Key Features of the Expo Center include:</p><ul><li>Carpeted  Space for (Two) Exhibit Areas - Sizes: 120' x 220' and 75' x 155' </li><li>Easy  Set-up and Tear-down with a Standard Loading Dock for Tractor Trailers, as well  as a Two-story High Garage Door for Vehicle Access </li><li>Vehicles  are permitted on the floor - Stipulations: Plastic must be placed under the  vehicle once in place, minimal gas should be in the gas tank and the battery  must be disconnected prior to the start of the show </li><li>Permanent  Registration Desk with (Two) Phone Lines capable for outside calling, as well  as Landline Access for Internet or Credit Card Machines </li><li>Wireless  High Speed Internet Access available throughout the whole Expo Center </li><li>Electricity  available from standard 110v Hook-up to complete 220 Phase Hard-wired into our  system - Onsite Electricians are available for assistance with all your  electricity needs </li><li>All  events in the Expo Center include Cleaning and Garbage Removal - Rental of  Garbage Dumpsters available at a charge for appropriate sizes </li><li>Vendor  parking areas close to the Exhibit areas</li></ul><div class='hr-content-width' style='margin: 0 0 25px 0;'></div><h3>Meeting Packages</h3><p>Our extensive amenities make Split Rock Resort the ideal choice for your next meeting. With both experience and precision, we make your meetings important, enjoyable, and even unforgettable. All of Split Rock Resort's complete Meeting Packages are customizable to stir your imagination, challenge your expectations, and raise the return on your meeting investment. </p><p>Meeting Packages  can be customized to include: </p><ul><li>Dedicated  Convention Services Manager - all packages</li><li>Multiple  Days of Overnight Accommodations</li><li>Breakfast,  Lunch &amp; Dinner Options</li><li>Banquet  &amp; Meeting Facilities that perfectly accommodate your group</li><li>Audio-visual  Services</li><li>Morning  &amp; Afternoon Refreshment Breaks with Starbucks Coffee Service</li><li>Complimentary  Wireless High Speed Internet Access in Meeting and Sleeping Rooms</li><li>Corporate  Recreation &amp; Resort Entertainment</li><li>Read  More <a href='/pdfs/team%20building.pdf' target='_blank'>About Our Sample Team Building Activities</a> </li></ul><p>Call <a href='tel:1-888-802-2348'>(888) 802-2348</a> and ask to speak with our sales department to start customizing your ideal Meeting Package.</p>"
}
]