[{"_template":"html","content":"<h2>The Pennsylvania Blues Festival</h2>\n<h4>September 16 &ndash; 18, 2016</h4>\n<div class=\"col1 left\" style=\"padding-bottom: 0px;\">\n<p>&nbsp;</p>\n<p>Split Rock Resort is&nbsp;once again hosting the&nbsp;<strong>Pennsylvania Blues Festival</strong> in&nbsp;picturesque&nbsp;Lake Harmony. Join us as we celebrate the <strong>Blues turning silver</strong> with<strong> 25 consecutive years</strong> in the<strong> Pocono Mountains</strong> of Eastern Pennsylvania.</p>\n<p>This award winning festival showcases <strong>17 National Acts</strong> throughout the weekend on two stages (a concert stage and a 9000 square foot tent stage) with plenty of food and beverages, free parking, and dozens of artisans displaying their wares and a community that embraces this event with open arms. <strong>Three indoor showcases</strong> (Friday Night, Saturday Night &amp; Sunday Morning) are held in the impressive Galleria Conference Center a short walk from the<strong> Festival </strong>Grounds.</p>\n<p>This year's festival will feature music by <strong>Beareather Reddy</strong>, <strong>Mickey Junior's Blues Revue</strong>, <strong>Slam Allen,</strong> Zac Harmon, Anthony Geraci &amp; the Boston Blues Allstars, <strong>Kenny Neal</strong>, Guy Davis, Blackburn, <strong>The Campbell Brothers</strong>, Andy T Nixon Band, &nbsp;<strong>Toronzo Cannon</strong>, Delmark Records Revue, <strong>Ronnie Earl</strong>, Harrison Kennedy, and <strong>Vanessa Collier</strong>.<br /><br />Unfortunately, our headliner <strong>Buckwheat Zydeco</strong> will not be performing due to his doctor's orders; however, we are pleased to announce our new <strong>headliners</strong> are&nbsp;The <strong>Ronnie Baker Brooks Blues Band</strong> &amp; Blues Hall Of Famer <strong>Eddy \"The Chief\" Clearwater</strong>.<br /><br />Kick off <strong>Friday Night</strong> with an <strong>Arrival Party</strong> at the<strong> Rock Bar</strong> with Beareather Reddy. The <strong>Party Continues</strong> at the <strong>Thirsty Moose Saloon</strong> Friday, Saturday, and Sunday from 9PM to 1AM with music by <strong>Sterling Koch Crossroads Duo</strong>, <strong>Bobby Kyle Band</strong>, and <strong>Vanessa Collier</strong>.</p>\n<p>Throughout the weekend music fans that travel far and wide to the Pennsylvania Blues Festival can expect Contemporary and Traditional<strong> Blues, Soul, Gospel, and New Orleans Themed Music</strong> in a beautiful up close and personal setting.</p>\n</div>","rendered_height":500}]